# Built In Failures Rebar Shape Failures Invalid Crank Parameters Combination Property

Source: https://www.revitapidocs.com/2026/4088109a-b8fa-be8f-a400-2181c4acfc3f.htm

---

| Built In Failures Rebar Shape Failures Invalid Crank Parameters Combination Property |
| --- |

Invalid combination of crank parameters.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId InvalidCrankParametersCombination { get; }
```

```
Public Shared ReadOnly Property InvalidCrankParametersCombination As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ InvalidCrankParametersCombination {
	FailureDefinitionId^ get ();
}
```

```
static member InvalidCrankParametersCombination : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures RebarShapeFailures Class Autodesk.Revit.DB Namespace